ricardoxy/MY-REPO/Blink/BLKLED_15/pic18f45k20_Config.c
/*Config Code File
 * File:   PIC18_config.c
 * Author: Ricardo Munoz
 *
 *
 * Created on: Aug 18, 2020
 *
 * This file was created to configure the pic18f45k20 device.
 *
 * Compiler: XC8
 * MPLAB IDE: X
 */

/********************************INCLUDES**************************************/
//#include "pic18f45k20.h"
#include "pic18f45k20_Config.h"

 #include <xc.h>
//#include <stdio.h>

//SUMMARY OF REGISTERS ASSOCIATED WITH CLOCK SOURCES                       //Power on reset Brown out reset
//NAME       Bit7     Bit6      Bit5   Bit4   Bit3   Bit2   Bit1   Bit0    //Value on POR, BOR // Value on otherResets(1)
//CONFIG1H   IESO     FCMEN     ?      ?      FOSC3  FOSC2  FOSC1  FOSC0     ?                    ?
//INTCON     GIE/GIEH PEIE/GIEL TMR0IE INT0IE RBIE   TMR0IF INT0IF RBIF      0000 000x            0000 000x
//OSCCON     IDLEN    IRCF2     IRCF1  IRCF0  OSTS   IOFS   SCS1   SCS0      0011 q000            0011 q000
//OSCTUNE    INTSRC   PLLEN     TUN5   TUN4   TUN3   TUN2   TUN1   TUN0      0000 0000            000u uuuu
//PIE2       OSCFIE   C1IE      C2IE   EEIE   BCLIE  HLVDIE TMR3IE CCP2IE    0000 0000            0000 0000
//PIR2       OSCFIF   C1IF      C2IF   EEIF   BCLIF  HLVDIF TMR3IF CCP2IF    0000 0000            0000 0000
//IPR2       OSCFIP   ?         ?      ?      ?      ?      ?      ?         1111 1111            1111 1111

// OSCCON: OSCILLATOR CONTROL REGISTER pg 29
//The OSCCON register (Register 2-1) controls several
// aspects of the device clock?s operation, both in full
// power operation and in power-managed modes.
// configure oscillator routine

void OSC_freq (void)
{
    
  
  //  OSCCONbits.IDLEN = 0;       // Bit 7
                                //if 1 = Device enters **Idle** mode on SLEEP instruction
                                //if 0 = Device enters **Sleep** mode on SLEEP instruction
    
    OSCCONbits.IRCF2 = 1;       // Bit 6 (HFINTOSC 16MHz  drives clock directly)
    OSCCONbits.IRCF1 = 0;       // Bit 5
    OSCCONbits.IRCF0 = 1;       // Bit 4
                                
                                // 111 = 16 MHz (HFINTOSC drives clock directly)
                                // 110 = 8 MHz
                                // 101 = 4 MHz
                                // 100 = 2 MHz
                           //***// 011 = 1 MHz if nothing is selected 1MHZ is selected by default (3)
                                // 010 = 500 kHz
                                // 001 = 250 kHz
                                // 000 = 31 kHz (from either HFINTOSC/512 or LFINTOSC directly)(2)
    
 //   OSCCONbits.OSTS =0;         // Bit 3
                                // 1 = Device is running from the clock defined by FOSC<2:0> of the CONFIG1 register
                                // 0 = Device is running from the internal oscillator (HFINTOSC or LFINTOSC)
                                //
  //  OSCCONbits.IOFS =0;         // Bit 2
                                // 1 = HFINTOSC frequency is stable
                                // 0 = HFINTOSC frequency is not stable
                                   
    
 //   OSCCONbits.SCS1 = 0;         // Bit 1 *********************
 //   OSCCONbits.SCS0 = 0;         // Bit 0
                                 // 1x = Internal oscillator block
                                 // 01 = Secondary (Timer1) oscillator
                                 // 00 = Primary clock (determined by CONFIG1H[FOSC<3:0>]).
                  

                                // OSCTUNE: OSCILLATOR TUNING REGISTER - pg33
                                // OSCTUNE is responsible for tuning the frequency within a range of +/-12 percent
                                // on the selected frequency.
    //OSCTUNEbits.INTSRC = 0;     // Bit 7
                                // if 1 = 31.25 kHz device clock derived from 16 MHz HFINTOSC source (divide-by-512 enabled)
                                // if 0 = 31 kHz device clock derived directly from LFINTOSC internal oscillator
   
    
    
   // OSCTUNEbits.PLLEN = 0;      // Frequency Multiplier PLL for HFINTOSC Enable bit
                                // 1 = PLL enabled for HFINTOSC (8 MHz and 16 MHz only)
                                // 0 = PLL disabled
    
    
}   // end OSC_freq


//******************************************************************************************************************//
// interrupts
// internal interrus timers ad conveter serial io eeprom  low volt detectoion module
// ITCON register usually deals with EXTERNAL interrups
// PIR PIE IPR deals with interal interrups
// each interrupt source has 3 bits to control opertaion
// first flag bit indicates a interrup occur
// second a bit allows for interrupt to the address vector when set
// third bit selects high or low priority
                               // RCON: RESET CONTROL REGISTER - pg 51
                               // Device Reset events are tracked through the RCON
                               // register (Register 4-1). The lower five bits of the register indicate
                               // that a specific Reset event has occurred. In
                               // most cases, these bits can only be cleared by the event
                               // and must be set by the application after the event
                               // There are ten registers which are used to control
                               // interrupt operation. These registers are:
                               //  ? RCON
                               //  ? INTCON
                               //  ? INTCON2
                               //  ? INTCON3
                               //  ? PIR1, PIR2
                               //  ? PIE1, PIE2
                               //  ? IPR1, IPR2
  // INTCON: INTERRUPT CONTROL REGISTER - pg116
  //NAME       Bit7      Bit6      Bit5    Bit4    Bit3   Bit2   Bit1   Bit0   //Value on POR,BOR // Value on otherResets(1)
  //RCON       IPEN      SBOREN(1) ?       RI      TO     PD     POR(2) BOR     0q-1 11q0
  //INTCON     GIE/GIEH  PEIE/GIEL TMR0IE  INT0IE  RBIE   TMR0IF INT0IF RBIF    0000 000x         0000 000u uuuu uuuu(1)
  //INTCON2    RBPU      INTEDG0   INTEDG1 INTEDG2 ?      TMR0IP ?      RBIP    1111 -1-1         1111 -1-1 uuuu -u-u(1)
  //INTCON3    INT2IP    INT1IP    ?       INT2IE  INT1IE ?      INT2IF INT1IF  11-0 0-00         11-0 0-00 uu-u u-uu(1)
  //       ***REGISTERS ASSOCIATED WITH PARALLEL SLAVE PORT
  //PIR1       PSPIF(1)  ADIF     RCIF     TXIF    SSPIF  CCP1IF TMR2IF TMR1IF  0000 0000         0000 0000
  //PIE1       PSPIE(1)  ADIE     RCIE     TXIE    SSPIE  CCP1IE TMR2IE TMR1IE  0000 0000         0000 0000
  //IPR1       PSPIP(1)  ADIP     RCIP     TXIP    SSPIP  CCP1IP TMR2IP TMR1IP  1111 1111         1111 1111
  //     ***REGISTERS ASSOCIATED WITH TIMER3 AS A TIMER/COUNTER
  //PIR2       OSCFIF    C1IF     C2IF     EEIF    BCLIF  HLVDIF TMR3IF CCP2IF  0000 0000         0000 0000
  //PIE2       OSCFIE    C1IE     C2IE     EEIE    BCLIE  HLVDIE TMR3IE CCP2IE  0000 0000         0000 0000
  //IPR2       OSCFIP    C1IP     C2IP     EEIP    BCLIP  HLVDIP TMR3IP CCP2IP  1111 1111         1111 1111

void interrups_initial(void)
{
                               
   // RCON register sets up the goblal priority for all interrups
    

 //   RCONbits.IPEN = 0;          // Bit 7 pg 52
                                // IPEN: Interrupt Priority Enable bit
                                // 1 = Enable priority levels on interrupts
                                // 0 = Disable priority levels on interrupts (PIC16CXXX Compatibility mode)
    
    
  //  RCONbits.SBOREN = 0;        // bit 6 SBOREN: BOR Software Enable bit(1)
                                // If BOREN<1:0> = 01:
                                // 1 = BOR is enabled
                                // 0 = BOR is disabled
                                // If BOREN<1:0> = 00, 10 or 11:
                                // Bit is disabled and read as ?0?.
       
                                // Bit 5 Unimplemented: Read as ?0?
        
   // RCONbits.RI= 1;             // Bit 4 RI: RESET Instruction Flag bit
                                // 1 = The RESET instruction was not executed (set by firmware or Power-on Reset)
                                // 0 = The RESET instruction was executed causing a device Reset (must be set in
                                //firmware after a code-executed Reset occurs)
                             
  //  RCONbits.RI= 1;             // Bit 3 TO: Watchdog Time-out Flag bit
                                // 1 = Set by power-up, CLRWDT instruction or SLEEP instruction
                                // 0 = A WDT time-out occurred
   
  //  RCONbits.PD= 1;             // Bit 2 PD: Power-down Detection Flag bit
                                // 1 = Set by power-up or by the CLRWDT instruction
                                // 0 = Set by execution of the SLEEP instruction
  
