ricardoxy/MY-REPO/Blink/BLKLED_15/pic18f45k20_Config.c
   // RCONbits.POR= 0;            // bit 1 POR: Power-on Reset Status bit(2)
                                //  1 = No Power-on Reset occurred
                                // 0 = A Power-on Reset occurred (must be set in software after a Power-on Reset occurs)
   
  //  RCONbits.BOR= 0;            // bit 0 BOR: Brown-out Reset Status bit(3)
                                // 1 = A Brown-out Reset has not occurred (set by firmware only
                                // 0 = A Brown-out Reset occurred (must be set by firmware after a POR or Brown-out
                                // Reset occurs)
    

  //  INTCONbits.GIE_GIEH = 0;    // Bit 7  Enables all unmasked interrupts  these are relate to  RCONbits.IPEN when enable
                                // When IPEN = 0:   PG 109
                                // 1 = Enables all unmasked interrupts
                                // 0 = Disables all interrupts including peripherals
                                // When IPEN = 1:
                                // 1 = Enables all high priority interrupts
                                // 0 = Disables all interrupts including low priority.
    
   // INTCONbits.PEIE_GIEL = 0;   // Bit 6 Enables all unmasked peripheral interrupts
                                // When IPEN = 0:
                                // 1 = Enables all unmasked peripheral interrupts
                                // 0 = Disables all peripheral interrupts
                                // When IPEN = 1:
                                // 1 = Enables all low priority interrupts
                                // 0 = Disables all low priority interrupts

  //  INTCONbits.TMR0IE = 0;      // Bit 5 TMR0 Overflow Interrupt Enable bit
                                //1 = Enables the TMR0 overflow interrupt
                                //0 = Disables the TMR0 overflow interrupt
    
  //  INTCONbits.INT0IE = 0;      // Bit 4 INT0 External Interrupt Enable bit
                                //1 = Enables the INT0 external interrupt
                                //0 = Disables the INT0 external interrupt
   
  //  INTCONbits.RBIE = 0;        // Bit 3 RB Port Change Interrupt Enable bit
                                //1 = Enables the RB port change interrupt
                                //0 = Disables the RB port change interrup
    
    INTCONbits.TMR0IF = 1;      // Bit 2 TMR0 Overflow Interrupt Flag bit *******************************************
                                //1 = TMR0 register has overflowed (must be cleared by software)
                                //0 = TMR0 register did not overflow
    
 //   INTCONbits.INT0IF = 0;      // Bit 1 INT0 External Interrupt Flag bit
                                //1 = The INT0 external interrupt occurred (must be cleared by software)
                                // 0 = The INT0 external interrupt did not occur
    
   // INTCONbits.RBIF= 0;         // Bit 0 RB Port Change Interrupt Flag bit(1)
                                //1 = At least one of the RB<7:4> pins changed state (must be cleared by software)
                                //0 = None of the RB<7:4> pins have changed state
  
}




//********************************************************************************************************//
    
    //TIMER pg 58, 155  // T0CON: TIMER0 CONTROL REGISTER
    //NAME        Bit7      Bit6      Bit5    Bit4    Bit3   Bit2   Bit1   Bit0   //Value on POR,BOR
    //TMR0H       Timer0 Register, High Byte                                        0000 0000
    //TMR0L       Timer0 Register, Low Byte                                         xxxx xxxx
    //T0CON       TMR0ON    T08BIT    T0CS    T0SE    PSA    T0PS2  T0PS1  T0PS0    1111 1111

void Timer_0(void)
{
    T0CON = 0b00000001;
               

   // T0CONbits.TMR0ON = 0;      // Bit 7 Enables Timer0  Timer0 On/Off Control bit*********
                               //  1 = Enables Timer0
                               //  0 = Stops Timer0
   // T0CONbits.T08BIT = 0;      // Bit 6 Timer0 8-bit/16-bit Control bit
                               //  1 = Timer0 is configured as an 8-bit timer/counter
                               //  0 = Timer0 is configured as a 16-bit timer/counter
   // T0CONbits.T0CS = 0;        // Bit 5  Timer0 Clock Source Select bit ******************
                               //  1 = Transition on T0CKI pin
                               //  0 = Internal instruction cycle clock (CLKOUT)
   // T0CONbits.T0SE = 0;        // Bit 4  Timer0 Source Edge Select bit
                               //  1 = Increment on high-to-low transition on T0CKI pin
                               //  0 = Increment on low-to-high transition on T0CKI pin
  //  T0CONbits.PSA =0;         // Bit 3  Timer0 Prescaler Assignment bit
                               // 1 = TImer0 prescaler is NOT assigned. Timer0 clock input bypasses prescaler.
                               // 0 = Timer0 prescaler is assigned. Timer0 clock input comes from prescaler output
    
    
    T0CONbits.T0PS2 = 0;       // Bit 2-0  Timer0 Prescaler Select bits
    T0CONbits.T0PS1 = 0;
    T0CONbits.T0PS0 = 1;
                               // 111 = 1:256 prescale value
                               // 110 = 1:128 prescale value
                               // 101 = 1:64 prescale value
                               // 100 = 1:32 prescale value
                               // 011 = 1:16 prescale value
                               // 010 = 1:8 prescale value
                               // 001 = 1:4 prescale value one second delay per pulse full cycle is 2 seconds
                               // 000 = 1:2 prescale value with 1MHZ  and this pre we get 1/2 sec delay full cycle one second
    
}
     

//*****TIMER 1 pg 58, 157
//NAME        Bit7     Bit6      Bit5    Bit4    Bit3    Bit2   Bit1   Bit0   //Value on POR,BOR
//TMR1H       Timer1 Register, High Byte                                        xxxx xxxx
//TMR1L       Timer1 Register, Low Bytes                                        xxxx xxxx
//T1CON       RD16     T1RUN     T1CKPS1 T1CKPS0 T1OSCEN T1SYNC TMR1CS TMR1ON   0000 0000

void Timer_1(void){
    
    T1CONbits.RD16 = 0;    // Bit 7 RD16: 16-bit Read/Write Mode Enable bit
                           // 1 = Enables register read/write of TImer1 in one 16-bit operation
                           // 0 = Enables register read/write of Timer1 in two 8-bit operations
    
