ricardoxy/MY-REPO/Blink/BLKLED_15/pic18f45k20_Config.c
    T1CONbits.T1RUN = 0;   // Bit 6  Timer1 System Clock Status bit
                           // 1 = Main system clock is derived from Timer1 oscillator
                           // 0 = Main system clock is derived from another source
   
    T1CONbits.T1CKPS1 = 0; // Bit 5 <1:0>: Timer1 Input Clock Prescale Select bits
    T1CONbits.T1CKPS0 = 0; // Bit 4
                           // 11 = 1:8 Prescale value
                           // 10 = 1:4 Prescale value
                           // 01 = 1:2 Prescale value
                           // 00 = 1:1 Prescale value
    
    T1CONbits.T1OSCEN = 0; // Bit 3  Timer1 Oscillator Enable bit
                           // 1 = Timer1 oscillator is enabled
                           // 0 = Timer1 oscillator is shut off
    
    T1CONbits.T1SYNC = 0;  // Bit 2  Timer1 External Clock Input Synchronization Select bit
                           // When TMR1CS = 1:
                           // 1 = Do not synchronize external clock input
                           // 0 = Synchronize external clock input
                           // When TMR1CS = 0:
                           // This bit is ignored. Timer1 uses the internal clock when TMR1CS = 0.
    
    
    T1CONbits.TMR1CS = 0;  // Bit 1 : Timer1 Clock Source Select bit
                           // 1 = External clock from pin RC0/T1OSO/T13CKI (on the rising edge)
                           // 0 = Internal clock (FOSC/4)
   
    T1CONbits.TMR1ON = 0;  // Bit 0 Timer1 On bit
                           // 1 = Enables Timer1
                           // 0 = Stops Timer1
}


//*****TIMER 2 pg 58, 167
//NAME        Bit7      Bit6      Bit5     Bit4     Bit3     Bit2   Bit1    Bit0     //Value on POR,BOR
//TMR2        Timer2 Register                                                           0000 0000
//PR2         Timer2 Period Register                                                    1111 1111
//T2CON       ?         T2OUTPS3  T2OUTPS2 T2OUTPS1 T2OUTPS0 TMR2ON T2CKPS1 T2CKPS0    -000 0000

void Timer_2(void){
    
    //T2CONbits.U = 0;         // Bit 7 Unimplemented read as zero
    T2CONbits.T2OUTPS3 = 0;    // Bit 6
    T2CONbits.T2OUTPS2 = 0;    // Bit 5
    T2CONbits.T2OUTPS1 = 0;    // Bit 4
    T2CONbits.T2OUTPS0 = 0;    // Bit 3   Timer2 Output Postscale Select bits 6,5,4,3
                               //0000 = 1:1 Postscale
                               //0001 = 1:2 Postscale
                               //?
                               //?
                               //?
                               //1111 = 1:16 Postscale
    
    T2CONbits.TMR2ON = 0;        // Bit 2 Timer2 On bit
                               // 1 = Timer2 is on
                               // 0 = Timer2 is off
    
    
    T2CONbits.T2CKPS1 = 0;    // Bit 1
    T2CONbits.T2CKPS0 = 0;    // Bit 0   Timer2 Clock Prescale Select bits 1,0
                           // 00 = Prescaler is 1
                           // 01 = Prescaler is 4
                           // 1x = Prescaler is 16
}


//*****TIMER 3 pg 59, 169
//NAME        Bit7      Bit6    Bit5    Bit4    Bit3   Bit2   Bit1   Bit0   //Value on POR,BOR
//TMR3H       Timer3 Register, High Byte                                      xxxx xxxx
//TMR3L       Timer3 Register, Low Byte                                       xxxx xxxx
//T3CON       RD16      T3CCP2  T3CKPS1 T3CKPS0 T3CCP1 T3SYNC TMR3CS TMR3ON   0000 0000
void Timer_3(void){
    
    T3CONbits.RD16 = 0;    // Bit 7
                           // 1 = Enables register read/write of Timer3 in one 16-bit operation
                           // 0 = Enables register read/write of Timer3 in two 8-bit operations
    
    
    T3CONbits.T3CCP2 = 0;  // Bit 6
    T3CONbits.T3CCP1 = 0;  // Bit 3   Timer3 and Timer1 to CCPx Enable bits 6 and 3
                           // 1x = Timer3 is the capture/compare clock source for CCP1 and CP2
                           // 01 = Timer3 is the capture/compare clock source for CCP2 and
                           // Timer1 is the capture/compare clock source for CCP1
                           // 00 = Timer1 is the capture/compare clock source for CCP1 and CP2
    
    T3CONbits.T3CKPS1 = 0; // Bit 5
    T3CONbits.T3CKPS0 = 0; // Bit 4  Timer3 Input Clock Prescale Select bits  5 and 4
                           // 11 = 1:8 Prescale value
                           // 10 = 1:4 Prescale value
                           // 01 = 1:2 Prescale value
                           // 00 = 1:1 Prescale value
    
    T3CONbits.T3SYNC = 0;  // Bit 2 Timer3 External Clock Input Synchronization Control bit
                           // (Not usable if the device clock comes from Timer1/Timer3.)
                           // When TMR3CS = 1:
                           // 1 = Do not synchronize external clock input
                           // 0 = Synchronize external clock input
                           // When TMR3CS = 0:
                           // This bit is ignored. Timer3 uses the internal clock when TMR3CS = 0.
    
    T3CONbits.TMR3CS = 0;  // Bit 1  Timer3 Clock Source Select bit
                           // 1 = External clock input from Timer1 oscillator or T13CKI
                           // (on the rising edge after the first falling edge)
                           // 0 = Internal clock (FOSC/4)
    
    T3CONbits.TMR3ON = 0;  // Bit 0 Timer3 On bit
                           // 1 = Enables Timer3
                           // 0 = Stops Timer3
}


    
    
//*************************************************************************************
//EUSART link to timer2 // REGISTERS ASSOCIATED WITH ASYNCHRONOUS TRANSMISSION

//NAME    Bit7      Bit6      Bit5   Bit4   Bit3   Bit2   Bit1   Bit0   //Value on POR,BOR
//INTCON  GIE/GIEH  PEIE/GIEL TMR0IE INT0IE RBIE   TMR0IF INT0IF RBIF 57
//PIR1    PSPIF(1)  ADIF      RCIF   TXIF   SSPIF  CCP1IF TMR2IF TMR1IF 60
//PIE1    PSPIE(1)  ADIE      RCIE   TXIE   SSPIE  CCP1IE TMR2IE TMR1IE 60
//IPR1    PSPIP(1)  ADIP      RCIP   TXIP   SSPIP  CCP1IP TMR2IP TMR1IP 60
//RCSTA   SPEN      RX9       SREN   CREN   ADDEN  FERR   OERR   RX9D 59
//TXREG   EUSART Transmit Register 59
//TXSTA   CSRC      TX9       TXEN   SYNC   SENDB  BRGH   TRMT   TX9D 59
//BAUDCON ABDOVF    RCIDL     DTRXP  CKTXP  BRG16  ?      WUE    ABDEN 59
//SPBRGH  EUSART Baud Rate Generator Register, High Byte 59
//SPBRG   EUSART Baud Rate Generator Register, Low Byte 59
//RCREG   EUSART Receive Register   0000 0000 59, 234


// The operation of the EUSART module is controlled
// through three registers:  pg 236

//? Transmit Status and Control (TXSTA)
//? Receive Status and Control (RCSTA)
//? Baud Rate Control (BAUDCON)

//NAME    Bit7      Bit6      Bit5   Bit4   Bit3   Bit2   Bit1   Bit0   //Value on POR,BOR
//TXSTA   CSRC      TX9       TXEN   SYNC   SENDB  BRGH   TRMT   TX9D     0000 0010
//RCSTA   SPEN      RX9       SREN   CREN   ADDEN  FERR   OERR   RX9D     0000 000x
//BAUDCON ABDOVF    RCIDL     DTRXP  CKTXP  BRG16  ?      WUE    ABDEN    0100 0-00

// instruction Cycle Clock


// The EUSART receiver is enabled for asynchronous
// operation by configuring the following three control bits:
// ? CREN = 1
// ? SYNC = 0
// ? SPEN = 1

void EUSART(void)
{

