ricardoxy/MY-REPO/Blink/BLKLED_15/pic18f45k20_Config.c
   //TXSTA: TRANSMIT STATUS AND CONTROL REGISTER - pg244
   TXSTAbits.CSRC = 0;          // Bit 7  Asynchronous mode:
                                // Don?t care
                                // Synchronous mode:
                                // 1 = Master mode (clock generated internally from BRG)
                                // 0 = Slave mode (clock from external source)
    
    TXSTAbits.TX9 = 0;          // Bit 6    9-bit Transmit Enable bit
                                // 1 = Selects 9-bit transmission
                                // 0 = Selects 8-bit transmission
    
    TXSTAbits.TXEN = 1;         // Bit 5 Transmit enabled   bit****************************
                                // 1 = Transmit enabled
                                // 0 = Transmit disabled
    
    TXSTAbits.SYNC = 0;         // Bit 4 EUSART Mode Select bit
                                // 1 = Synchronous mode
                                // 0 = Asynchronous mode
    
    TXSTAbits.SENDB = 0;        // Bit 3 Send Break Character bit
                                // Asynchronous mode:
                                // 1 = Send Sync Break on next transmission (cleared by hardware upon completion)
                                // 0 = Sync Break transmission completed
                                // Synchronous mode:
                                // Don?t care
    
    TXSTAbits.BRGH = 0;         // Bit 2  High Baud Rate Select bit
                                // Asynchronous mode:
                                // 1 = High speed
                                // 0 = Low speed
                                // Synchronous mode:
                                // Unused in this mode
    
    TXSTAbits.TRMT = 1;         // Bit 1  Transmit Shift Register Status bit
                                // 1 = TSR empty
                                // 0 = TSR full
    
    TXSTAbits.TX9D = 0;         // Bit 0 Ninth bit of Transmit Data
                                //Can be address/data bit or a parity bit.
                                //SREN/CREN overrides TXEN in Sync mode

    

    // RCSTA1: RECEIVE STATUS AND CONTROL REGISTER - pg245
    
    RCSTAbits.SPEN = 1;        // Bit 7 Serial port enabled
                               // 1 = Serial port enabled (configures RX/DT and TX/CK pins as serial port pins)
                               // 0 = Serial port disabled (held in Reset)
    
    RCSTAbits.RX9 = 0;         // Bit 6  9-bit Receive Enable bit
                               // 1 = Selects 9-bit reception
                               // 0 = Selects 8-bit reception
    
    RCSTAbits.SREN = 0;        // Bit 5 Single Receive Enable bit
                               // Asynchronous mode:
                               // Don?t care
                               // Synchronous mode ? Master:
                               // 1 = Enables single receive
                               // 0 = Disables single receive
                               // This bit is cleared after reception is complete.
                               // Synchronous mode ? Slave
                               // Don?t care
    
    RCSTAbits.CREN = 0;        // Bit 4  Continuous Receive Enable bit
                               // Asynchronous mode:
                               // 1 = Enables receiver
                               // 0 = Disables receiver
                               // Synchronous mode:
                               // 1 = Enables continuous receive until enable bit CREN is cleared (CREN overrides SREN)
                               // 0 = Disables continuous receive
                                
    RCSTAbits.ADDEN = 0;       // Bit 3 Address Detect Enable bit
                               // Asynchronous mode 9-bit (RX9 = 1):
                               //  1 = Enables address detection, enable interrupt and
                               //load the receive buffer when RSR<8> is set
                               // 0 = Disables address detection, all bytes are received and
                               //ninth bit can be used as parity bit
                               // Asynchronous mode 8-bit (RX9 = 0):
                               // Don?t care
    
    RCSTAbits.FERR = 0;        // Bit 2  Framing Error bit
                               // 1 = Framing error (can be updated by reading RCREG register and receive next valid byte)
                               // 0 = No framing error
    
    RCSTAbits.OERR = 0;        // Bit 1  Overrun Error bit
                               // 1 = Overrun error (can be cleared by clearing bit CREN)
                               // 0 = No overrun error
    
    RCSTAbits.RX9D = 0;        // Bit 0  Ninth bit of Received Data
                               //This can be address/data bit or a parity bit and
                               //must be calculated by user firmware
    

    
    // BAUDCON: BAUD RATE CONTROL REGISTER - pg246
    BAUDCONbits.ABDOVF = 0;     // Bit 7 Auto-Baud Detect Overflow bit
                                // Asynchronous mode:
                                // 1 = Auto-baud timer overflowed
                                // 0 = Auto-baud timer did not overflow
                                // Synchronous mode:
                                // Don?t care
    
    BAUDCONbits.RCIDL = 0;     // Bit 6 Receive Idle Flag bit
                               // Asynchronous mode:
                               // 1 = Receiver is Idle
                               // 0 = Start bit has been detected and the receiver is active
                               // Synchronous mode:
                               // Don?t care
    
    BAUDCONbits.DTRXP = 1;     // Bit 5 Data/Receive Polarity Select bit
                               // Asynchronous mode:
                               // 1 = Receive data (RX) is inverted (active-low)
                               // 0 = Receive data (RX) is not inverted (active-high)
                               // Synchronous mode:
                               // 1 = Data (DT) is inverted (active-low)
                               // 0 = Data (DT) is not inverted (active-high)
    
    BAUDCONbits.CKTXP = 0;     // Bit 4 Clock/Transmit Polarity Select bit
                               // Asynchronous mode:
                               // 1 = Idle state for transmit (TX) is low
                               // 0 = Idle state for transmit (TX) is high
                               // Synchronous mode:
                               // 1 = Data changes on the falling edge of the clock and is sampled on the rising edge of the clock
                               // 0 = Data changes on the rising edge of the clock and is sampled on the falling edge of the clock
        
    BAUDCONbits.BRG16 = 1;     // Bit 3 16-bit Baud Rate Generator bit
                               // 1 = 16-bit Baud Rate Generator is used (SPBRGH:SPBRG)
                               // 0 = 8-bit Baud Rate Generator is used (SPBRG)
    
    //BAUDCONbits.Unimplemented = 0; // Bit 2 unimplemented read as zero
    
    
    
    BAUDCONbits.WUE = 0;       // Bit 1  Wake-up Enable bit
                               // Asynchronous mode:
                               // 1 = Receiver is waiting for a falling edge. No character will be
                               // received but RCIF will be set on the falling
                               // edge. WUE will automatically clear on the rising edge.
                               // 0 = Receiver is operating normally
                               // Synchronous mode:
                               // Don?t care
        
    BAUDCONbits.ABDEN = 0;     // Bit 0  Auto-Baud Detect Enable bit
                               // Asynchronous mode:
                               // 1 = Auto-Baud Detect mode is enabled (clears when auto-baud is complete)
                               // 0 = Auto-Baud Detect mode is disabled
                               // Synchronous mode:
                               // Don?t care

    // Baud Rate Generator
    // SPBRGH EUSART Baud Rate Generator Register, High Byte 59
    // SPBRG EUSART Baud Rate Generator Register, Low Byte 59
    // SPBRG = 0;
    // when   BAUDCONbits.BRG16= 1; // 16 bit baud rate mode
         // fosc/16(value+1 )= baudrate
         // SPBRG = Fosc/(16x9600) -1
         // you can change the Fosc by setting OSCCONbits.IRCF
         // SPBRG = (4MHZ/ (16x9600)) -1  =25
         // 9600 baud rate value is 25
         // SPBRG = (@16MHZ/ (16x9600)) -1  =103.1
}








